wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/lpadc_reg.h
#define LPADC_ADCR_TRGCOND_Pos          (6)                                         /*!< LPADC_T::ADCR: TRGCOND Position            */
#define LPADC_ADCR_TRGCOND_Msk          (0x3UL << LPADC_ADCR_TRGCOND_Pos)           /*!< LPADC_T::ADCR: TRGCOND Mask                */

#define LPADC_ADCR_TRGEN_Pos            (8)                                         /*!< LPADC_T::ADCR: TRGEN Position              */
#define LPADC_ADCR_TRGEN_Msk            (0x1UL << LPADC_ADCR_TRGEN_Pos)             /*!< LPADC_T::ADCR: TRGEN Mask                  */

#define LPADC_ADCR_PTEN_Pos             (9)                                         /*!< LPADC_T::ADCR: PTEN Position               */
#define LPADC_ADCR_PTEN_Msk             (0x1UL << LPADC_ADCR_PTEN_Pos)              /*!< LPADC_T::ADCR: PTEN Mask                   */

#define LPADC_ADCR_DIFFEN_Pos           (10)                                        /*!< LPADC_T::ADCR: DIFFEN Position             */
#define LPADC_ADCR_DIFFEN_Msk           (0x1UL << LPADC_ADCR_DIFFEN_Pos)            /*!< LPADC_T::ADCR: DIFFEN Mask                 */

#define LPADC_ADCR_ADST_Pos             (11)                                        /*!< LPADC_T::ADCR: ADST Position               */
#define LPADC_ADCR_ADST_Msk             (0x1UL << LPADC_ADCR_ADST_Pos)              /*!< LPADC_T::ADCR: ADST Mask                   */

#define LPADC_ADCR_RESET_Pos            (12)                                        /*!< LPADC_T::ADCR: RESET Position              */
#define LPADC_ADCR_RESET_Msk            (0x1UL << LPADC_ADCR_RESET_Pos)             /*!< LPADC_T::ADCR: RESET Mask                  */

#define LPADC_ADCR_PRELDCH_Pos          (15)                                        /*!< LPADC_T::ADCR: PRELDCH Position            */
#define LPADC_ADCR_PRELDCH_Msk          (0x1UL << LPADC_ADCR_PRELDCH_Pos)           /*!< LPADC_T::ADCR: PRELDCH Mask                */

#define LPADC_ADCR_TRGS_Pos             (16)                                         /*!< LPADC_T::ADCR: TRGS Position               */
#define LPADC_ADCR_TRGS_Msk             (0xfUL << LPADC_ADCR_TRGS_Pos)              /*!< LPADC_T::ADCR: TRGS Mask                   */

///ChingI wait to check
#define LPADC_ADCR_ACMPTES_Pos          (20)                          
#define LPADC_ADCR_ACMPTES_Msk          (0x3UL << LPADC_ADCR_ACMPTES_Pos)

#define LPADC_ADCR_ULPEN_Pos            (24)                                        /*!< LPADC_T::ADCR: ULPEN Position              */
#define LPADC_ADCR_ULPEN_Msk            (0x1UL << LPADC_ADCR_ULPEN_Pos)             /*!< LPADC_T::ADCR: ULPEN Mask                  */

#define LPADC_ADCR_DECSET_Pos           (25)                                        /*!< LPADC_T::ADCR: DECSET Position             */
#define LPADC_ADCR_DECSET_Msk           (0x1UL << LPADC_ADCR_DECSET_Pos)            /*!< LPADC_T::ADCR: DECSET Mask                 */

#define LPADC_ADCR_RESSEL_Pos           (28)                                        /*!< LPADC_T::ADCR: RESSEL Position             */
#define LPADC_ADCR_RESSEL_Msk           (0x3UL << LPADC_ADCR_RESSEL_Pos)            /*!< LPADC_T::ADCR: RESSEL Mask                 */

#define LPADC_ADCR_DMOF_Pos             (31)                                        /*!< LPADC_T::ADCR: DMOF Position               */
#define LPADC_ADCR_DMOF_Msk             (0x1UL << LPADC_ADCR_DMOF_Pos)              /*!< LPADC_T::ADCR: DMOF Mask                   */

#define LPADC_ADCHER_CHEN_Pos           (0)                                         /*!< LPADC_T::ADCHER: CHEN Position             */
#define LPADC_ADCHER_CHEN_Msk           (0xffffffffUL << LPADC_ADCHER_CHEN_Pos)     /*!< LPADC_T::ADCHER: CHEN Mask                 */

#define LPADC_ADCMPR_CMPEN_Pos          (0)                                         /*!< LPADC_T::ADCMPR: CMPEN Position            */
#define LPADC_ADCMPR_CMPEN_Msk          (0x1UL << LPADC_ADCMPR_CMPEN_Pos)           /*!< LPADC_T::ADCMPR: CMPEN Mask                */

#define LPADC_ADCMPR_CMPIE_Pos          (1)                                         /*!< LPADC_T::ADCMPR: CMPIE Position            */
#define LPADC_ADCMPR_CMPIE_Msk          (0x1UL << LPADC_ADCMPR_CMPIE_Pos)           /*!< LPADC_T::ADCMPR: CMPIE Mask                */

#define LPADC_ADCMPR_CMPCOND_Pos        (2)                                         /*!< LPADC_T::ADCMPR: CMPCOND Position          */
#define LPADC_ADCMPR_CMPCOND_Msk        (0x1UL << LPADC_ADCMPR_CMPCOND_Pos)         /*!< LPADC_T::ADCMPR: CMPCOND Mask              */

#define LPADC_ADCMPR_CMPCH_Pos          (3)                                         /*!< LPADC_T::ADCMPR: CMPCH Position            */
#define LPADC_ADCMPR_CMPCH_Msk          (0x1fUL << LPADC_ADCMPR_CMPCH_Pos)          /*!< LPADC_T::ADCMPR: CMPCH Mask                */

#define LPADC_ADCMPR_CMPMATCNT_Pos      (8)                                         /*!< LPADC_T::ADCMPR: CMPMATCNT Position        */
#define LPADC_ADCMPR_CMPMATCNT_Msk      (0xfUL << LPADC_ADCMPR_CMPMATCNT_Pos)       /*!< LPADC_T::ADCMPR: CMPMATCNT Mask            */

#define LPADC_ADCMPR_CMPWEN_Pos         (15)                                        /*!< LPADC_T::ADCMPR: CMPWEN Position           */
#define LPADC_ADCMPR_CMPWEN_Msk         (0x1UL << LPADC_ADCMPR_CMPWEN_Pos)          /*!< LPADC_T::ADCMPR: CMPWEN Mask               */

#define LPADC_ADCMPR_CMPD_Pos           (16)                                        /*!< LPADC_T::ADCMPR: CMPD Position             */
#define LPADC_ADCMPR_CMPD_Msk           (0xfffUL << LPADC_ADCMPR_CMPD_Pos)          /*!< LPADC_T::ADCMPR: CMPD Mask                 */

#define LPADC_ADSR0_ADF_Pos             (0)                                         /*!< LPADC_T::ADSR0: ADF Position               */
#define LPADC_ADSR0_ADF_Msk             (0x1UL << LPADC_ADSR0_ADF_Pos)              /*!< LPADC_T::ADSR0: ADF Mask                   */

#define LPADC_ADSR0_CMPF0_Pos           (1)                                         /*!< LPADC_T::ADSR0: CMPF0 Position             */
#define LPADC_ADSR0_CMPF0_Msk           (0x1UL << LPADC_ADSR0_CMPF0_Pos)            /*!< LPADC_T::ADSR0: CMPF0 Mask                 */

#define LPADC_ADSR0_CMPF1_Pos           (2)                                         /*!< LPADC_T::ADSR0: CMPF1 Position             */
#define LPADC_ADSR0_CMPF1_Msk           (0x1UL << LPADC_ADSR0_CMPF1_Pos)            /*!< LPADC_T::ADSR0: CMPF1 Mask                 */

#define LPADC_ADSR0_BUSY_Pos            (7)                                         /*!< LPADC_T::ADSR0: BUSY Position              */
#define LPADC_ADSR0_BUSY_Msk            (0x1UL << LPADC_ADSR0_BUSY_Pos)             /*!< LPADC_T::ADSR0: BUSY Mask                  */

#define LPADC_ADSR0_VALIDF_Pos          (8)                                         /*!< LPADC_T::ADSR0: VALIDF Position            */
#define LPADC_ADSR0_VALIDF_Msk          (0x1UL << LPADC_ADSR0_VALIDF_Pos)           /*!< LPADC_T::ADSR0: VALIDF Mask                */

