wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/lpadc_reg.h
#define LPADC_ADSR0_OVERRUNF_Pos        (16)                                        /*!< LPADC_T::ADSR0: OVERRUNF Position          */
#define LPADC_ADSR0_OVERRUNF_Msk        (0x1UL << LPADC_ADSR0_OVERRUNF_Pos)         /*!< LPADC_T::ADSR0: OVERRUNF Mask              */

#define LPADC_ADSR0_ADPRDY_Pos          (24)                                        /*!< LPADC_T::ADSR0: ADPRDY Position          */
#define LPADC_ADSR0_ADPRDY_Msk          (0x1UL << LPADC_ADSR0_ADPRDY_Pos)           /*!< LPADC_T::ADSR0: ADPRDY Mask              */

#define LPADC_ADSR0_CHANNEL_Pos         (27)                                        /*!< LPADC_T::ADSR0: CHANNEL Position           */
#define LPADC_ADSR0_CHANNEL_Msk         (0x1fUL << LPADC_ADSR0_CHANNEL_Pos)         /*!< LPADC_T::ADSR0: CHANNEL Mask               */

#define LPADC_ADSR1_VALID_Pos           (0)                                         /*!< LPADC_T::ADSR1: VALID Position             */
#define LPADC_ADSR1_VALID_Msk           (0xffffffffUL << LPADC_ADSR1_VALID_Pos)     /*!< LPADC_T::ADSR1: VALID Mask                 */

#define LPADC_ADSR2_OVERRUN_Pos         (0)                                         /*!< LPADC_T::ADSR2: OVERRUN Position           */
#define LPADC_ADSR2_OVERRUN_Msk         (0xffffffffUL << LPADC_ADSR2_OVERRUN_Pos)   /*!< LPADC_T::ADSR2: OVERRUN Mask               */

#define LPADC_ESMPCTL_EXTSMPT_Pos       (0)                                         /*!< LPADC_T::ESMPCTL: EXTSMPT Position         */
#define LPADC_ESMPCTL_EXTSMPT_Msk       (0x3fffUL << LPADC_ESMPCTL_EXTSMPT_Pos)     /*!< LPADC_T::ESMPCTL: EXTSMPT Mask             */

#define LPADC_CFDCTL_PRECHEN_Pos        (0)                                         /*!< LPADC_T::CFDCTL: PRECHEN Position          */
#define LPADC_CFDCTL_PRECHEN_Msk        (0x1UL << LPADC_CFDCTL_PRECHEN_Pos)         /*!< LPADC_T::CFDCTL: PRECHEN Mask              */

#define LPADC_CFDCTL_DISCHEN_Pos        (1)                                         /*!< LPADC_T::CFDCTL: DISCHEN Position          */
#define LPADC_CFDCTL_DISCHEN_Msk        (0x1UL << LPADC_CFDCTL_DISCHEN_Pos)         /*!< LPADC_T::CFDCTL: DISCHEN Mask              */

#define LPADC_CFDCTL_FDETCHEN_Pos       (8)                                         /*!< LPADC_T::CFDCTL: FDETCHEN Position         */
#define LPADC_CFDCTL_FDETCHEN_Msk       (0x1UL << LPADC_CFDCTL_FDETCHEN_Pos)        /*!< LPADC_T::CFDCTL: FDETCHEN Mask             */

#define LPADC_ADTEST_FIFOCNT_Pos        (0)                                         /*!< LPADC_T::ADTEST: FIFOCNT Position          */
#define LPADC_ADTEST_FIFOCNT_Msk        (0xfUL << LPADC_ADTEST_FIFOCNT_Pos)         /*!< LPADC_T::ADTEST: FIFOCNT Mask              */

#define LPADC_ADTEST_CalUnLock_Pos      (28)                                        /*!< LPADC_T::ADTEST: CalUnLock Position        */
#define LPADC_ADTEST_CalUnLock_Msk      (0x1UL << LPADC_ADTEST_CalUnLock_Pos)       /*!< LPADC_T::ADTEST: CalUnLock Mask            */

#define LPADC_ADPDMA_CURDAT_Pos         (0)                                         /*!< LPADC_T::ADPDMA: CURDAT Position           */
#define LPADC_ADPDMA_CURDAT_Msk         (0x3ffffUL << LPADC_ADPDMA_CURDAT_Pos)      /*!< LPADC_T::ADPDMA: CURDAT Mask               */

#define LPADC_ADCAL_CALEN_Pos          (0)                                         /*!< LPADC_T::ADCAL: CALEN Position            */
#define LPADC_ADCAL_CALEN_Msk          (0x1UL << LPADC_ADCAL_CALEN_Pos)           /*!< LPADC_T::ADCAL: CALEN Mask                */

#define LPADC_ADCAL_CALIE_Pos          (1)                                         /*!< LPADC_T::ADCAL: CALIE Position            */
#define LPADC_ADCAL_CALIE_Msk          (0x1UL << LPADC_ADCAL_CALIE_Pos)           /*!< LPADC_T::ADCAL: CALIE Mask                */

#define LPADC_ADCAL_MODEVM_Pos         (2)                                         /*!< LPADC_T::ADCAL: MODEVM Position           */
#define LPADC_ADCAL_MODEVM_Msk         (0x1UL << LPADC_ADCAL_MODEVM_Pos)          /*!< LPADC_T::ADCAL: MODEVM Mask               */

#define LPADC_ADCAL_CALSEL16T_Pos      (3)                                         /*!< LPADC_T::ADCAL: CALSEL16T Position        */
#define LPADC_ADCAL_CALSEL16T_Msk      (0x1UL << LPADC_ADCAL_CALSEL16T_Pos)       /*!< LPADC_T::ADCAL: CALSEL16T Mask            */

#define LPADC_ADCAL_CALSEL_Pos         (4)                                         /*!< LPADC_T::ADCAL: CALSEL Position           */
#define LPADC_ADCAL_CALSEL_Msk         (0x7UL << LPADC_ADCAL_CALSEL_Pos)          /*!< LPADC_T::ADCAL: CALSEL Mask               */

#define LPADC_ADCALSTS_CALIF_Pos       (0)                                         /*!< LPADC_T::ADCALSTS: CALIF Position         */
#define LPADC_ADCALSTS_CALIF_Msk       (0x1UL << LPADC_ADCALSTS_CALIF_Pos)        /*!< LPADC_T::ADCALSTS: CALIF Mask             */

#define LPADC_ADCALDB_CALRD_Pos        (0)                                         /*!< LPADC_T::ADCALDB: CALRD Position          */
#define LPADC_ADCALDB_CALRD_Msk        (0x1UL << LPADC_ADCALDB_CALRD_Pos)         /*!< LPADC_T::ADCALDB: CALRD Mask              */

#define LPADC_ADCALDB_CALWR_Pos        (1)                                         /*!< LPADC_T::ADCALDB: CALWR Position          */
#define LPADC_ADCALDB_CALWR_Msk        (0x1UL << LPADC_ADCALDB_CALWR_Pos)         /*!< LPADC_T::ADCALDB: CALWR Mask              */

#define LPADC_ADCALDB_OUTSEL_Pos      (2)                                         /*!< LPADC_T::ADCALDB: OUTSEL Position        */
#define LPADC_ADCALDB_OUTSEL_Msk      (0x1UL << LPADC_ADCALDB_OUTSEL_Pos)       /*!< LPADC_T::ADCALDB: OUTSEL Mask            */

#define LPADC_ADCALDB_CALADDR_Pos      (3)                                         /*!< LPADC_T::ADCALDB: CALADDR Position        */
#define LPADC_ADCALDB_CALADDR_Msk      (0x1fUL << LPADC_ADCALDB_CALADDR_Pos)      /*!< LPADC_T::ADCALDB: CALADDR Mask            */

#define LPADC_ADCALDB_CALWDATA_Pos     (8)                                         /*!< LPADC_T::ADCALDB: CALWDATA Position       */
#define LPADC_ADCALDB_CALWDATA_Msk     (0xffUL << LPADC_ADCALDB_CALWDATA_Pos)     /*!< LPADC_T::ADCALDB: CALWDATA Mask           */

