wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/lpadc_reg.h
#define LPADC_ADCALDB_CALRDATA_Pos     (16)                                        /*!< LPADC_T::ADCALDB: CALRDATA Position       */
#define LPADC_ADCALDB_CALRDATA_Msk     (0xfffUL << LPADC_ADCALDB_CALRDATA_Pos)    /*!< LPADC_T::ADCALDB: CALRDATA Mask           */

#define LPADC_ADCALDB_DEBUGEN_Pos      (31)                                        /*!< LPADC_T::ADCALDB: DEBUGEN Position        */
#define LPADC_ADCALDB_DEBUGEN_Msk      (0x1UL << LPADC_ADCALDB_DEBUGEN_Pos)       /*!< LPADC_T::ADCALDB: DEBUGEN Mask            */

#define LPADC_AUTOCTL_TRIGSEL_Pos       (0)                                         /*!< LPADC_T::AUTOCTL: TRIGSEL Position         */
#define LPADC_AUTOCTL_TRIGSEL_Msk       (0x7UL << LPADC_AUTOCTL_TRIGSEL_Pos)        /*!< LPADC_T::AUTOCTL: TRIGSEL Mask             */

#define LPADC_AUTOCTL_TRIGEN_Pos        (4)                                         /*!< LPADC_T::AUTOCTL: TRIGEN Position          */
#define LPADC_AUTOCTL_TRIGEN_Msk        (0x1UL << LPADC_AUTOCTL_TRIGEN_Pos)         /*!< LPADC_T::AUTOCTL: TRIGEN Mask              */

#define LPADC_AUTOCTL_WKEN_Pos          (8)                                         /*!< LPADC_T::AUTOCTL: WKEN Position            */
#define LPADC_AUTOCTL_WKEN_Msk          (0x1UL << LPADC_AUTOCTL_WKEN_Pos)           /*!< LPADC_T::AUTOCTL: WKEN Mask                */

#define LPADC_AUTOCTL_CMP0WKEN_Pos      (9)                                         /*!< LPADC_T::AUTOCTL: CMP0WKEN Position            */
#define LPADC_AUTOCTL_CMP0WKEN_Msk      (0x1UL << LPADC_AUTOCTL_CMP0WKEN_Pos)           /*!< LPADC_T::AUTOCTL: CMP0WKEN Mask                */

#define LPADC_AUTOCTL_CMP1WKEN_Pos      (10)                                        /*!< LPADC_T::AUTOCTL: CMP1WKEN Position            */
#define LPADC_AUTOCTL_CMP1WKEN_Msk      (0x1UL << LPADC_AUTOCTL_CMP1WKEN_Pos)       /*!< LPADC_T::AUTOCTL: CMP1WKEN Mask                */

#define LPADC_AUTOCTL_AUTOEN_Pos        (31)                                        /*!< LPADC_T::AUTOCTL: AUTOEN Position          */
#define LPADC_AUTOCTL_AUTOEN_Msk        (0x1UL << LPADC_AUTOCTL_AUTOEN_Pos)         /*!< LPADC_T::AUTOCTL: AUTOEN Mask              */

#define LPADC_AUTOSTRG_SWTRIG_Pos       (0)                                         /*!< LPADC_T::AUTOSTRG: SWTRIG Position         */
#define LPADC_AUTOSTRG_SWTRIG_Msk       (0x1UL << LPADC_AUTOSTRG_SWTRIG_Pos)        /*!< LPADC_T::AUTOSTRG: SWTRIG Mask             */

#define LPADC_AUTOSTS_WKIF_Pos          (0)                                         /*!< LPADC_T::AUTOSTS: WKIF Position            */
#define LPADC_AUTOSTS_WKIF_Msk          (0x1UL << LPADC_AUTOSTS_WKIF_Pos)           /*!< LPADC_T::AUTOSTS: WKIF Mask                */

#define LPADC_AUTOSTS_CMP0WKF_Pos       (1)                                      /*!< LPADC_T::AUTOSTS: CMP0WKF Position            */
#define LPADC_AUTOSTS_CMP0WKF_Msk       (0x1UL << LPADC_AUTOSTS_CMP0WKF_Pos)     /*!< LPADC_T::AUTOSTS: CMP0WKF Mask                */

#define LPADC_AUTOSTS_CMP1WKF_Pos       (2)                                      /*!< LPADC_T::AUTOSTS: CMP1WKF Position            */
#define LPADC_AUTOSTS_CMP1WKF_Msk       (0x1UL << LPADC_AUTOSTS_CMP1WKF_Pos)     /*!< LPADC_T::AUTOSTS: CMP1WKF Mask                */

#define LPADC_ALDOCTL_VTRIM_Pos         (0)                                         /*!< LPADC_T::ALDOCTL: VTRIM Position           */
#define LPADC_ALDOCTL_VTRIM_Msk         (0x7UL << LPADC_ALDOCTL_VTRIM_Pos)          /*!< LPADC_T::ALDOCTL: VTRIM Mask               */

#define LPADC_ALDOCTL_ISEL_Pos          (4)                                         /*!< LPADC_T::ALDOCTL: ISEL Position            */
#define LPADC_ALDOCTL_ISEL_Msk          (0x3UL << LPADC_ALDOCTL_ISEL_Pos)           /*!< LPADC_T::ALDOCTL: ISEL Mask                */

#define LPADC_ALDOCTL_TESTEN_Pos        (7)                                         /*!< LPADC_T::ALDOCTL: TESTEN Position          */
#define LPADC_ALDOCTL_TESTEN_Msk        (0x1UL << LPADC_ALDOCTL_TESTEN_Pos)         /*!< LPADC_T::ALDOCTL: TESTEN Mask              */

#define LPADC_ALDOCTL_ALDOEN_Pos        (8)                                         /*!< LPADC_T::ALDOCTL: ALDOEN Position          */
#define LPADC_ALDOCTL_ALDOEN_Msk        (0x1UL << LPADC_ALDOCTL_ALDOEN_Pos)         /*!< LPADC_T::ALDOCTL: ALDOEN Mask              */

#define LPADC_ALDOCTL_STBSEL_Pos        (16)                                        /*!< LPADC_T::ALDOCTL: STBSEL Position          */
#define LPADC_ALDOCTL_STBSEL_Msk        (0xfUL << LPADC_ALDOCTL_STBSEL_Pos)         /*!< LPADC_T::ALDOCTL: STBSEL Mask              */

#define LPADC_ALDOCTL_IGENEN_Pos        (23)                                        /*!< LPADC_T::ALDOCTL: IGENEN Position          */
#define LPADC_ALDOCTL_IGENEN_Msk        (0x1UL << LPADC_ALDOCTL_IGENEN_Pos)         /*!< LPADC_T::ALDOCTL: IGENEN Mask              */

#define LPADC_MTEST_PCHSEN_Pos          (0)                                         /*!< LPADC_T::MTEST: PCHSEN Position            */
#define LPADC_MTEST_PCHSEN_Msk          (0x1UL << LPADC_MTEST_PCHSEN_Pos)           /*!< LPADC_T::MTEST: PCHSEN Mask                */

#define LPADC_MTEST_PCHSSEL_Pos         (4)                                         /*!< LPADC_T::MTEST: PCHSSEL Position           */
#define LPADC_MTEST_PCHSSEL_Msk         (0x7UL << LPADC_MTEST_PCHSSEL_Pos)          /*!< LPADC_T::MTEST: PCHSSEL Mask               */

#define LPADC_MTEST_DECADD_Pos          (8)                                         /*!< LPADC_T::MTEST: DECADD Position            */
#define LPADC_MTEST_DECADD_Msk          (0x1UL << LPADC_MTEST_DECADD_Pos)           /*!< LPADC_T::MTEST: DECADD Mask                */

#define LPADC_MTEST_OSR_Pos             (24)                                        /*!< LPADC_T::MTEST: OSR Position               */
#define LPADC_MTEST_OSR_Msk             (0xffUL << LPADC_MTEST_OSR_Pos)             /*!< LPADC_T::MTEST: OSR Mask                   */

#define LPADC_DEBUG_ENFLO_Pos           (0)                                         /*!< LPADC_T::DEBUG: ENFLO Position             */
#define LPADC_DEBUG_ENFLO_Msk           (0x1UL << LPADC_DEBUG_ENFLO_Pos)            /*!< LPADC_T::DEBUG: ENFLO Mask                 */

#define LPADC_DEBUG_ENBOOST_Pos         (1)                                         /*!< LPADC_T::DEBUG: ENBOOST Position           */
#define LPADC_DEBUG_ENBOOST_Msk         (0x1UL << LPADC_DEBUG_ENBOOST_Pos)          /*!< LPADC_T::DEBUG: ENBOOST Mask               */

#define LPADC_DEBUG_SELAYNC_Pos         (4)                                         /*!< LPADC_T::DEBUG: SELAYNC Position           */
#define LPADC_DEBUG_SELAYNC_Msk         (0x1UL << LPADC_DEBUG_SELAYNC_Pos)          /*!< LPADC_T::DEBUG: SELAYNC Mask               */

#define LPADC_DEBUG_SELASYF_Pos         (5)                                         /*!< LPADC_T::DEBUG: SELASYF Position           */
#define LPADC_DEBUG_SELASYF_Msk         (0x1UL << LPADC_DEBUG_SELASYF_Pos)          /*!< LPADC_T::DEBUG: SELASYF Mask               */

#define LPADC_DEBUG_ASDELAYC_Pos        (8)                                         /*!< LPADC_T::DEBUG: ASDELAYC Position          */
#define LPADC_DEBUG_ASDELAYC_Msk        (0x3UL << LPADC_DEBUG_ASDELAYC_Pos)         /*!< LPADC_T::DEBUG: ASDELAYC Mask              */

