wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/lpadc_reg.h
#define LPADC_DEBUG_ASDELAYF_Pos        (10)                                        /*!< LPADC_T::DEBUG: ASDELAYF Position          */
#define LPADC_DEBUG_ASDELAYF_Msk        (0x3UL << LPADC_DEBUG_ASDELAYF_Pos)         /*!< LPADC_T::DEBUG: ASDELAYF Mask              */

#define LPADC_DEBUG_TRIMSMPL_Pos        (16)                                        /*!< LPADC_T::DEBUG: TRIMSMPL Position          */
#define LPADC_DEBUG_TRIMSMPL_Msk        (0xffUL << LPADC_DEBUG_TRIMSMPL_Pos)        /*!< LPADC_T::DEBUG: TRIMSMPL Mask              */

#define LPADC_DEBUG_DEBUGEN_Pos         (31)                                        /*!< LPADC_T::DEBUG: DEBUGEN Position           */
#define LPADC_DEBUG_DEBUGEN_Msk         (0x1UL << LPADC_DEBUG_DEBUGEN_Pos)          /*!< LPADC_T::DEBUG: DEBUGEN Mask               */

#define LPADC_VERSION_MINOR_Pos       (0)                                         /*!< LPADC_T::VERSION: MINOR Position         */
#define LPADC_VERSION_MINOR_Msk       (0xffffUL << LPADC_VERSION_MINOR_Pos)     /*!< LPADC_T::VERSION: MINOR Mask             */

#define LPADC_VERSION_SUB_Pos         (16)                                        /*!< LPADC_T::VERSION: SUB Position           */
#define LPADC_VERSION_SUB_Msk         (0xffUL << LPADC_VERSION_SUB_Pos)         /*!< LPADC_T::VERSION: SUB Mask               */

#define LPADC_VRSION_MAJOR_Pos       (24)                                        /*!< LPADC_T::VERSION: MAJOR Position         */
#define LPADC_VERSION_MAJOR_Msk       (0xffUL << LPADC_VRSION_MAJOR_Pos)       /*!< LPADC_T::VERSION: MAJOR Mask             */


/** @} LPADC_CONST */
/** @} end of LPADC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __LPADC_REG_H__ */
